IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_i2c_write_regs.xml
<module id="CM_I2C_WRITE_REGS" HW_revision="" description="CM I2C WRITE Registers">
	<register id="I2CMCS_WRITE" width="32" page="1" offset="0x4" internal="0" description="I2C Master Control/Status">
		<bitfield id="RUN" description="I2C Master Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="START" description="Generate START" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STOP" description="Generate STOP" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ACK" description="Data Acknowledge Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="HS" description="High-Speed Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="QCMD" description="Quick Command" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="BURST" description="Burst Enable" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CSCSR_WRITE" width="32" page="1" offset="0x804" internal="0" description="I2C Slave Control/Status">
		<bitfield id="DA" description="Device Active" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TXFIFO" description="TX FIFO Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RXFIFO" description="RX FIFO Enable" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CFIFODATATX" width="32" page="1" offset="0xf00" internal="0" description="I2C FIFO Data TX">
		<bitfield id="DATA" description="I2C TX FIFO Write Data Byte" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
</module>
